## Задача 1. Промашка 4

Программа просто должна считать сумму чисел до тех пор, пока мы не ввели 0, но что-то пошло не так. Исправьте программу.
```python
number = int(input('Введите число: '))
while number <= 0:
    total += number
    number = int(input('Введите число: '))
print(total)
```

## Задача 2. Закономерность

Найдите закономерность и напишите программу с помощью одного цикла while. Каждая итерация цикла должна печатать одно число.

Ожидаемый итоговый вывод:
```text
7 14 21 28 35 42 49 56 63 70 77 84 91 98
```

## Задача 3. Пробежка

Представим, что у нас далёкое будущее и мы можем заниматься спортом на планетах со странными перепадами температур.

Спортсмен бегает по стадиону до тех пор, пока температура на улице больше 15 градусов.<br>
Он пробегает 20 метров, затем температура падает на два градуса, и, если уже в этот момент она стала меньше либо равна 15 градусам, спорт сразу заканчивается.<br>
Если же всё в порядке, то он проходит пешком ещё 10 метров.<br>
Затем всё это повторяется.

Напишите программу, которая спрашивает у пользователя, сколько на улице градусов, и, исходя из погоды, считает количество пройденных по стадиону метров и выводит ответ на экран. 


## Задача 4. Аварийная перемолка
Программа принимает на вход пользовательское число и считает сумму цифр справа налево.<br>
Если встречается цифра 5, то выводится уведомление и счёт суммы немедленно прерывается.<br>
В конце выводится сумма.


## Задача 5. Азарт

Напишите программу, которая запрашивает у пользователя начальное количество денег и, пока оно меньше 3000, запрашивает число, которое выпало на кубике (от 1 до 6). Если на кубике выпало 3, то выводится сообщение «Вы проиграли всё!», и деньги обнуляются. Если выпало другое число, к сумме прибавляется 300.

## Задача 6. Промашка 5

Семён хотел, чтобы выводились числа с 10 до 0 и сообщение о завершении работы таймера, но у него что-то пошло не так.
```python
count = 0
while count <= 10
    if count == 0:
        print('Время вышло!')
    else:
        print(count)
        count -= 1    
```

## Задача 7. Вирус

Семён написал вирус. Программа постоянно выводит на экран сообщение с требованием кода. Как только вводится правильный код запросы прекращаются.

## Задача 8. Три дыры

Напишите программу, которая запрашивает число и столько же раз выводит на экран строку "Три дыры стоят вот так, три дыры".

## Задача 9. Контроль бесконечности

Разработайте программу, которая бесконечно принимает числа и как только попадается число которые равно предыдущему, то задаётся вопрос о продолжении выполнения программы. В случае отказа от дальнейшего выполнения программа должна завершить работу, в ином случае продолжить.

## Задача 10. Кубы чисел

Напишите программу, которая возводит в третью степень каждое число от 1 до N и выводит результат на экран.

## Задача 11. Слишком большие числа

Напишите программу, которая считала бы, сколько цифр во вводимом числе.

## Задача 12. Обычный день на работе

Рабочий день длится 8 часов.

Напишите программу, которая спрашивает каждый час в течении рабочего дня сколько задач было сделано и спрашивает как настроение. Если настроение хоть раз было плохое, то нужно прекратить об этом спрашивать и в конце выполнения программы нужно вывести сообщение о том, что не всё так гладко как хотелось бы.

## Задача 13. Вклады

Вклад в банке составляет X рублей. Ежегодно он увеличивается на P процентов, после чего дробная часть копеек отбрасывается. Определите, через сколько лет вклад составит не менее Y рублей.

Напишите программу, которая по данным числам X, Y, P определяет, сколько лет пройдёт, прежде чем сумма достигнет значения Y.

## Задача 14. Угадай число

Напишите программу-игру, в которой один человек загадывает число от 1 до 10, а другой пытается его угадать. Программа должна запрашивать число у пользователя до тех пор, пока тот не угадает загаданное. После каждой попытки выводите подсказки, больше или меньше загаданного введённое число. Также после отгадки выводите количество попыток.

## Задача 15. Абсолютная эффективность***
Каждый раз, когда Рафаэль подходил к автомату, тот просил его загадать число от 1 до 100. Затем автомат, используя свои программные возможности, задавал вопросы: «Твоё число равно N?», «Твоё число больше N?» или «Твоё число меньше N?», где N — это число, которое он хотел проверить. Рафаэль отвечал с помощью простых чисел: 1 — равно, 2 — больше, 3 — меньше.
Автомат довольно медленно работал, перебирая все числа по порядку. Рафаэль решил увеличить эффективность автомата до абсолютного предела. 

Напишите программу, которая поможет быстрее угадать число. Постарайтесь удовлетворить амбиции Рафаэля.

<details>
    <summary>
     Значение абсолютной эффективности   
    </summary>
    Значение минимального максимума числа попыток отгадать число не превышает 7
</details>
