## Задача 1. Ревью кода
Силофилидрин работает middle-разработчиком на Python в IT-компании. Один кандидат на позицию junior-разработчика прислал ему код тестового задания.

В задании был словарь из трёх студентов. Необходимо:

- Вывести на экран список пар «ID студента — возраст».
- Написать функцию, которая принимает в качестве аргумента словарь и возвращает два значения: полный список интересов всех студентов и общую длину всех фамилий студентов.

Далее в основном коде вызывается функция, значения присваиваются отдельным переменным и выводятся на экран.

Силофилидрин — очень придирчивый программист, и после просмотра кода он понял, что этого кандидата на работу не возьмёт, хотя код выдаёт верный результат. Вот код кандидата:

```python
students = {
    1: {
        'name': 'Bob',
        'surname': 'Vazovski',
        'age': 23,
        'interests': ['biology, swimming']
    },
    2: {
        'name': 'Rob',
        'surname': 'Stepanov',
        'age': 24,
        'interests': ['math', 'computer games', 'running']
    },
    3: {
        'name': 'Alexander',
        'surname': 'Krug',
        'age': 22,
        'interests': ['languages', 'health food']
    }
}

def f(dict):
    lst = []
    string = ''
    for i in dict:
        lst += (dict[i]['interests'])
        string += dict[i]['surname']
    cnt = 0
    for s in string:
        cnt += 1
    return lst, cnt

pairs = []
for i in students:
    pairs += (i, students[i]['age'])

my_lst = f(students)[0]
l = f(students)[1]
print(my_lst, l)
```

Перепишите этот код так, чтобы он был максимально pythonic и Ваня мало к чему мог придраться (только если очень захочется). Убедитесь, что программа верно работает. Проверки на существование записей в словаре не обязательны, но приветствуются.

## Задача 2. Простые индексы
Напишите функцию, возвращающую список элементов итерируемого объекта (кортежа, строки, списка, словаря), у которых индекс — это простое число. 

Для проверки на простое число напишите отдельную функцию is_prime.

Сделайте так, чтобы основная функция состояла только из оператора return и так же возвращала список.

## Задача 3. Игроки
У вас есть словарь игроков, которые участвовали в трёх видах спорта. В словаре хранятся пары «ФИ — очки»:

```python
players = {
    ("Ivan", "Volkin"): (10, 5, 13),
    ("Bob", "Robbin"): (7, 5, 14),
    ("Rob", "Bobbin"): (12, 8, 2)
}
```

Напишите программу, которая объединяет ключ словаря со значением в один кортеж, и выведите результат на экран.

# Задача 4. По парам
Напишите программу, которая инициализирует список из 10 случайных целых чисел, а затем делит эти числа на пары кортежей внутри списка. Выведите результат на экран.

# Задача 5. Своя функция zip*
В самом конце собеседования вам неожиданно сказали: «Расскажите, что делает функция zip». Чтобы произвести впечатление, вы решили не только рассказать о ней, но и написать её аналог.

Даны строка и кортеж из чисел. Напишите программу, которая создаёт генератор из пар кортежей «символ — число». Затем выведите на экран сам генератор и кортежи.

Создайте полный аналог функции zip — сделайте так, чтобы программа работала с любыми итерируемыми типами данных.
