## Задача 1. Сообщение
Семён решил безобидно подшутить над другом и написал программу для смартфона, которая при отправке сообщения удваивает каждый символ строки и заодно к каждому удвоенному добавляет ещё один дополнительный.

Пользователь вводит строку и дополнительный символ. Напишите программу, которая генерирует два списка: в первом списке каждый элемент — удвоенная буква первой строки, во втором списке каждый элемент — конкатенация элемента первого списка и дополнительного символа.

Используйте list comprehensions.

## Задача 2. Повышение цен
Дан список цен на пять товаров с точностью до копейки. Так как экономика даёт о себе знать, мы спрогнозировали, что через год придётся повышать цены на X процентов, а ещё через один год — ещё на Y процентов.

Объявите в виде констант X, Y и список цен, где каждый элемент десятичная дробь, округлённая до сотых. Выведите в одну строку общую сумму стоимости товаров за каждый год.


## Задача 3. Магазин

У нас есть вот такой список цен на некоторые товары из магазина:
```python
original_prices = [1.25, -9.45, 10.22, 3.78, -5.92, 1.16]
```

В этом списке также хранятся цены на товары, которые уже давно не продаются. По какой-то причине система, вместо того чтобы их занулить, просто приписала к ним минус. Нам нужно это исправить.

Напишите программу, которая генерирует новый список из первого списка, заменяя все отрицательные числа на ноль.

## Задача 4. Отряды

Есть два отряда, в каждом по 10 монстров. В первом отряде у каждого монстра урон абсолютно случайный и колеблется от 50 до 80, а во втором — от 30 до 60. Оба отряда вместе напали на третий, также из 10 юнитов. Юнит третьего отряда погибает, если сумма урона от двух монстров больше 100.

Напишите программу, которая генерирует случайные значения в первых двух списках в заданных диапазонах, а также генерирует список, состоящий из фраз «Погиб» или «Выжил» и который будет представлять атакованный отряд. Выведите все списки на экран.


## Задача 5. Анализ цен

Нашему другу заказали написать программу, которая анализирует цены на бирже. Она получает этот пакет данных, но делать что-либо с ним нельзя. Для нормальной работы аналитической программы берётся новый список, который равен тому, что пришло. Затем идёт работа с новым списком: если есть отрицательные цены, то программа их зануляет и в конце выводит на экран, сколько денег мы по итогу потеряли. Получился вот такой код:
```python
original_prices = [-12, 3, 5, -2, 1]

new_prices = original_prices

for i in range(len(original_prices)):

    if new_prices[i] < 0:

        new_prices[i] = 0

print("Мы потеряли: ",  sum(original_prices) - sum(new_prices))
```

Однако при таких входных данных программа почему-то работает неправильно: она выводит ответ 0, когда правильный ответ 14. Помогите другу исправить программу, а также сделайте так, чтобы список цен генерировался случайно (диапазон можно выбрать любой).


## Задача 6. Срезы
Дан список чисел:

```python
nums = [48, -10, 9, 38, 17, 50, -5, 43, 46, 12]
```

Напишите программу, которая выводит на экран шесть ответов:

- В первой строке выведите первые пять элементов списка.
- Во второй строке выведите весь список, кроме последних двух элементов.
- В третьей строке выведите все элементы с чётными индексами.
- В четвёртой строке выведите все элементы с нечётными индексами.
- В пятой строке выведите все элементы в обратном порядке.
- В шестой строке выведите все элементы списка через один в обратном порядке, начиная с последнего.

Для решения используйте только срезы (и без функции len).

## Задача 7. Удаление части

Дан список из N чисел, а также числа А и В (можно сгенерировать случайно, при этом А < B). Напишите программу, которая удаляет элементы списка с индексами от А до В. Не используйте дополнительные переменные и методы списков.


## Задача 8. Гласный список
Напишите программу, которая запрашивает у пользователя текст и генерирует список гласных букв этого текста . Выведите в консоль сам список и его длину.

## Задача 9. Генерация

Пользователь вводит целое число N. Вам необходимо написать программу, которая генерирует список из чисел от 0 до N (не включая N) с условиями:

- если индекс числа чётный (или 0), то вместо числа необходимо взять 1;
- если индекс числа нечётный, то вместо числа необходимо взять остаток от деления этого числа на 5 (число % 5).

Предоставьте решение в одну строчку.

## Задача 10. Случайные соревнования
Что нужно сделать

Мы хотим протестировать работу электронной таблицы для участников некоторых соревнований. Есть два списка, то есть две команды, по 20 участников в каждом. В них хранятся очки каждого участника — вещественные числа с двумя знаками после точки, например 4.03. 

Член одной команды соревнуется с участником другой команды под таким же номером. То есть первый соревнуется с первым, второй — со вторым и так далее.

Напишите программу, которая генерирует два списка участников (по 20 элементов) из случайных вещественных чисел (от 5 до 10). Затем сгенерируйте третий список, в котором окажутся только победители из каждой пары.

## Задача 11. Тренировка со срезами
Дана строка, в которой хранятся первые семь букв английского алфавита. 
```python
alphabet = 'abcdefg'
```

Напишите программу, которая выводит на экран десять таких результатов:

- копию строки;
- элементы строки в обратном порядке;
- каждый второй элемент строки (включая самый первый);
- каждый второй элемент строки после первого;
- все элементы до второго;
- все элементы, начиная с конца до предпоследнего;
- все элементы в диапазоне индексов от 3 до 4 (не включая 4);
- последние три элемента строки;
- все элементы в диапазоне индексов от 3 до 4;
- то же, что и в предыдущем пункте, но в обратном порядке.


## Задача 12. Разворот

На вход в программу подаётся строка, в которой буква h встречается как минимум два раза. Реализуйте код, который разворачивает последовательность символов, заключённую между первым и последним появлением буквы h, в противоположном порядке.

<details>
<summary>Метод, о котором вы можете не знать</summary>
str.rindex - ищет индекс элемента начиная справа
</details>

## Задача 13. Двумерный список

```python
list_ = [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
```
Напишите программу, которая генерирует такой список и выводит его на экран. Используйте только list comprehensions. Решите задачу в одну строчку.

## Задача 14. Список списков

Дан многомерный список:
```python
nice_list = [[[1, 2, 3], [4, 5, 6], [7, 8, 9]], [[10, 11, 12], [13, 14, 15], [16, 17, 18]]]
```

Напишите код, который раскрывает все вложенные списки, то есть оставляет лишь внешний список. Для решения используйте только list comprehensions. 

## Задача 15. Шифр Цезаря*
Юлий Цезарь использовал свой способ шифрования текста. Каждая буква заменялась на следующую по алфавиту через K позиций по кругу. Если взять русский алфавит и K, равное 3, то в слове, которое мы хотим зашифровать, буква А станет буквой Г, Б станет Д и так далее.

Пользователь вводит сообщение и значение сдвига. Напишите программу, которая изменит фразу при помощи шифра Цезаря.
